{"config": [{"config": {"dot_axes": [-1, -1], "output_shape_type": "raw", "output_shape": null, "name": "merge_1", "concat_axis": -1, "mode_type": "raw", "layers": [{"config": [{"config": {"trainable": true, "target_shape": [4096], "batch_input_shape": [null, 4096], "name": "reshape_1", "input_dtype": "float32"}, "class_name": "Reshape"}], "class_name": "Sequential"}, {"config": [{"config": {"input_length": null, "output_dim": 500, "inner_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 23, 300], "consume_less": "cpu", "init": "glorot_uniform", "trainable": true, "U_regularizer": null, "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "unroll": false, "inner_init": "orthogonal", "name": "lstm_1", "b_regularizer": null, "input_dim": 300, "return_sequences": true, "input_dtype": "float32", "dropout_U": 0.0, "forget_bias_init": "one", "go_backwards": false}, "class_name": "LSTM"}, {"config": {"input_length": null, "output_dim": 500, "inner_activation": "hard_sigmoid", "stateful": false, "batch_input_shape": [null, 23, 300], "consume_less": "cpu", "init": "glorot_uniform", "trainable": true, "U_regularizer": null, "activation": "tanh", "dropout_W": 0.0, "W_regularizer": null, "unroll": false, "inner_init": "orthogonal", "name": "lstm_2", "b_regularizer": null, "input_dim": 500, "return_sequences": false, "input_dtype": "float32", "dropout_U": 0.0, "forget_bias_init": "one", "go_backwards": false}, "class_name": "LSTM"}], "class_name": "Sequential"}], "mode": "concat"}, "class_name": "Merge"}, {"config": {"trainable": true, "name": "dense_1", "output_dim": 1000, "b_regularizer": null, "activation": "relu", "input_dim": null, "init": "uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_2", "output_dim": 500, "b_regularizer": null, "activation": "relu", "input_dim": null, "init": "uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dense_3", "output_dim": 1000, "b_regularizer": null, "activation": "softmax", "input_dim": null, "init": "glorot_uniform", "activity_regularizer": null, "bias": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}