{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode_type": "raw", "mode": "concat", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "dot_axes": [-1, -1], "layers": [{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "input_dtype": "float32", "target_shape": [4096], "batch_input_shape": [null, 4096], "name": "reshape_1"}}]}, {"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"inner_activation": "hard_sigmoid", "input_dtype": "float32", "trainable": true, "go_backwards": false, "stateful": false, "b_regularizer": null, "dropout_W": 0.0, "return_sequences": true, "inner_init": "orthogonal", "consume_less": "cpu", "init": "glorot_uniform", "activation": "tanh", "input_length": null, "U_regularizer": null, "unroll": false, "output_dim": 50, "dropout_U": 0.0, "W_regularizer": null, "input_dim": 300, "batch_input_shape": [null, 23, 300], "name": "gru_1"}}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "b_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "activity_regularizer": null, "init": "uniform", "output_dim": 100, "W_regularizer": null, "activation": "relu", "name": "dense_1"}}, "trainable": true, "name": "timedistributed_1"}}, {"class_name": "Reshape", "config": {"trainable": true, "target_shape": [2300], "name": "reshape_2"}}]}], "name": "merge_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "init": "uniform", "output_dim": 1000, "W_regularizer": null, "activation": "relu", "name": "dense_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "init": "uniform", "output_dim": 500, "W_regularizer": null, "activation": "relu", "name": "dense_3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "trainable": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "b_regularizer": null, "bias": true, "init": "glorot_uniform", "output_dim": 1000, "W_regularizer": null, "activation": "softmax", "name": "dense_4"}}]}