{"config": [{"config": {"mode_type": "raw", "dot_axes": [-1, -1], "name": "merge_1", "output_shape_type": "raw", "concat_axis": -1, "layers": [{"config": [{"config": {"trainable": true, "batch_input_shape": [null, 4096], "target_shape": [4096], "name": "reshape_1", "input_dtype": "float32"}, "class_name": "Reshape"}], "class_name": "Sequential"}, {"config": [{"config": {"unroll": false, "go_backwards": false, "b_regularizer": null, "init": "glorot_uniform", "input_length": null, "U_regularizer": null, "output_dim": 50, "input_dtype": "float32", "return_sequences": true, "inner_init": "orthogonal", "trainable": true, "forget_bias_init": "one", "dropout_W": 0.0, "input_dim": 300, "activation": "tanh", "batch_input_shape": [null, 23, 300], "dropout_U": 0.0, "stateful": false, "inner_activation": "hard_sigmoid", "W_regularizer": null, "consume_less": "cpu", "name": "lstm_1"}, "class_name": "LSTM"}, {"config": {"trainable": true, "name": "timedistributed_1", "layer": {"config": {"activity_regularizer": null, "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "activation": "relu", "input_dim": null, "name": "dense_1", "output_dim": 100, "b_constraint": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "target_shape": [2300], "name": "reshape_2"}, "class_name": "Reshape"}], "class_name": "Sequential"}], "mode": "concat", "output_shape": null}, "class_name": "Merge"}, {"config": {"activation": "relu", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "activity_regularizer": null, "input_dim": null, "name": "dense_2", "output_dim": 1000, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "uniform", "activity_regularizer": null, "input_dim": null, "name": "dense_3", "output_dim": 500, "b_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "W_constraint": null, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "input_dim": null, "name": "dense_4", "output_dim": 1000, "b_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}