{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"name": "merge_1", "output_shape": null, "concat_axis": -1, "dot_axes": [-1, -1], "mode_type": "raw", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"batch_input_shape": [null, 4096], "trainable": true, "name": "reshape_1", "input_dtype": "float32", "target_shape": [4096]}}]}, {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"forget_bias_init": "one", "unroll": false, "batch_input_shape": [null, 23, 300], "input_dim": 300, "dropout_U": 0.0, "trainable": true, "input_length": null, "output_dim": 500, "name": "lstm_1", "W_regularizer": null, "init": "glorot_uniform", "stateful": false, "consume_less": "cpu", "go_backwards": false, "U_regularizer": null, "return_sequences": true, "b_regularizer": null, "dropout_W": 0.0, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "activation": "tanh"}}, {"class_name": "LSTM", "config": {"forget_bias_init": "one", "unroll": false, "batch_input_shape": [null, 23, 300], "input_dim": 500, "dropout_U": 0.0, "trainable": true, "input_length": null, "output_dim": 500, "name": "lstm_2", "W_regularizer": null, "init": "glorot_uniform", "stateful": false, "consume_less": "cpu", "go_backwards": false, "U_regularizer": null, "return_sequences": false, "b_regularizer": null, "dropout_W": 0.0, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "input_dtype": "float32", "activation": "tanh"}}]}], "mode": "concat", "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"bias": true, "init": "uniform", "input_dim": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1000, "name": "dense_1", "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "uniform", "input_dim": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 500, "name": "dense_2", "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1000, "name": "dense_3", "W_regularizer": null, "activation": "softmax"}}]}