{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"mode": "concat", "mode_type": "raw", "output_shape": null, "concat_axis": -1, "output_shape_type": "raw", "dot_axes": [-1, -1], "name": "merge_1", "layers": [{"class_name": "Sequential", "config": [{"class_name": "Reshape", "config": {"trainable": true, "input_dtype": "float32", "name": "reshape_1", "target_shape": [4096], "batch_input_shape": [null, 4096]}}]}, {"class_name": "Sequential", "config": [{"class_name": "GRU", "config": {"return_sequences": true, "inner_init": "orthogonal", "b_regularizer": null, "U_regularizer": null, "trainable": true, "consume_less": "cpu", "unroll": false, "input_dtype": "float32", "dropout_U": 0.0, "batch_input_shape": [null, 23, 300], "stateful": false, "init": "glorot_uniform", "go_backwards": false, "input_dim": 300, "activation": "tanh", "W_regularizer": null, "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "output_dim": 500, "input_length": null, "name": "gru_1"}}, {"class_name": "GRU", "config": {"return_sequences": false, "inner_init": "orthogonal", "b_regularizer": null, "U_regularizer": null, "trainable": true, "consume_less": "cpu", "unroll": false, "input_dtype": "float32", "dropout_U": 0.0, "batch_input_shape": [null, 23, 300], "stateful": false, "init": "glorot_uniform", "go_backwards": false, "input_dim": 500, "activation": "tanh", "W_regularizer": null, "inner_activation": "hard_sigmoid", "dropout_W": 0.0, "output_dim": 500, "input_length": null, "name": "gru_2"}}]}]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 1000, "trainable": true, "bias": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "init": "uniform", "name": "dense_1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 500, "trainable": true, "bias": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_constraint": null, "init": "uniform", "name": "dense_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "output_dim": 1000, "trainable": true, "bias": true, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "activation": "softmax", "b_constraint": null, "init": "glorot_uniform", "name": "dense_3"}}]}