{"config": [{"config": {"output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "layers": [{"config": [{"config": {"name": "reshape_1", "batch_input_shape": [null, 4096], "trainable": true, "input_dtype": "float32", "target_shape": [4096]}, "class_name": "Reshape"}], "class_name": "Sequential"}, {"config": [{"config": {"go_backwards": false, "activation": "tanh", "unroll": false, "output_dim": 50, "W_regularizer": null, "batch_input_shape": [null, 23, 300], "name": "lstm_1", "dropout_U": 0.0, "init": "glorot_uniform", "inner_init": "orthogonal", "b_regularizer": null, "input_dim": 300, "consume_less": "cpu", "input_length": null, "dropout_W": 0.0, "stateful": false, "forget_bias_init": "one", "U_regularizer": null, "input_dtype": "float32", "inner_activation": "hard_sigmoid", "trainable": true, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"name": "timedistributed_1", "layer": {"config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 100, "W_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_1", "bias": true, "trainable": true, "init": "uniform", "b_regularizer": null}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"name": "reshape_2", "trainable": true, "target_shape": [2300]}, "class_name": "Reshape"}], "class_name": "Sequential"}], "name": "merge_1", "concat_axis": -1, "dot_axes": [-1, -1], "mode": "concat"}, "class_name": "Merge"}, {"config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 1000, "W_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_2", "b_regularizer": null, "trainable": true, "init": "uniform", "bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 500, "W_regularizer": null, "b_constraint": null, "activation": "relu", "name": "dense_3", "b_regularizer": null, "trainable": true, "init": "uniform", "bias": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": null, "W_constraint": null, "output_dim": 1000, "W_regularizer": null, "b_constraint": null, "activation": "softmax", "name": "dense_4", "b_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true}, "class_name": "Dense"}], "class_name": "Sequential"}